# Завдання №1
# Число Армстронга - це таке натуральне число, яке дорівнює сумі своїх цифр,
#зведених в ступінь, рівну кількості його цифр. Знайти всі такі числа від 1 до n, де
#n вводиться на вимогу з клавіатури.

def armstrong():
    arm = list(input("Введіть число: ")) # Запрошуємо число Армстронга з клавіатури та змінюємо його тип на список
    
    sum_n = 0 # Змінна для суми чисел Армстронга
    count_n = 0 # Змінна з кількістю цифр в числі
    
    for i in arm:             # Рахуємо суму чисел і кількість цифр
        sum_n = sum_n + int(i)
        count_n = count_n + 1
    return(sum_n**count_n) # Повертаємо назад відповідь
print(armstrong()) # Виводимо відповідь

#Завдання №2
#Відомо, що з чотирьох уведених чисел x1, x2, x3, x4 три рівні між собою, а
#одне відмінне від них. Призначити змінній NF номер цього числа, а змінній F
#значення цього числа. Якщо введені некоректні дані, то повідомити про це.

def numbers():
    x1 = int(input("Введіть число x1: ")) # Записуємо числа з клавіатури
    x2 = int(input("Введіть число x2: "))
    x3 = int(input("Введіть число x3: "))
    x4 = int(input("Введіть число x4: "))
    n = 0                            # Змінні для запису обчислень

    sum_of_x = x2+x3+x4 # Сума всіх чисел для виявлення відмінного числа
    num_of_x = 9 # Змінна для рахування номеру відмінного числа

    if x1 == x2:                # Перевіряємо рівність чисел (В інших if відбувається точно те ж що і в цьому тільки з іншими змінними)
        n = n+1 # Якщо числа рівні плюсуємо 1 щоб перевірити умову пізніше
        sum_of_x = sum_of_x - x2 # Виносимо з суми всіх чисел рівні числа
        num_of_x = num_of_x - 2 # Виносимо номер цього числа з всіх номерів
    if x1 == x3:
        n = n+1
        sum_of_x = sum_of_x - x3
        num_of_x = num_of_x - 3
    if x1 == x4:
        n = n+1
        sum_of_x = sum_of_x - x4
        num_of_x = num_of_x - 4
    if (n == 0): # Якщо n = 0, то 1 число не дорівнює
        nF = 1 # Записуємо змінну nF
        f = x1 # Записуємо змінну F
    elif(n != 2): # Якщо n не дорівнює 2, то виходить, помилка в умові, через що вийшла помилка в обрахунках
        print("Введена неправильна умова, потрібно, щоб 3 числа були рівні, а 4 відмінне") # Виводимо відповідь в разі помилки умови
        return() # Зупинка коду щоб не виводився F,NF в разі помилки
    else: # Якщо n дорівнюватиме 2 значить задані числа правильні, і x1 дорівнює якимось 2 іншим числам, отже x2 або x3 або x4, не дорівнює
        f = sum_of_x # Записуємо F для відмінного числа
        nF = num_of_x # Заисуємо NF для відмінного числа
    print("F = ",f, "nF = ",nF) # Вивід відповіді
numbers()