def program1 (): # Створюємо функцію, щоб в подальшому простіше запускати програму
    while True: # Запускаємо нескінченний цикл, щоб програма перевіряла значення поки не буде введено правильне
        try:
            x = float(input("Введіть число x: ")) # Вводим число x

            if x == 0: # Перевіряєм на ділення на 0, щоб не було подальших помилок
                print("X не може дорівнювати 0")
                continue
            break
        except ValueError: #Перевіряєм чи це число та виводимо у випадку помилки
            print("Введено не число, спробуйте ще раз")
        except Exception as e: # Перевіряємо чи немає інших помилок та якщо є повідомляємо
            print(f"Непередбачена помилка: {e}")
    while True: # Запускаємо нескінченний цикл, щоб програма перевіряла значення поки не буде введено правильне
        try:
            n = int(input("Введіть число n: ")) # Вводим число n

            if n < 1: # Перевіряєм чи n більше за 1
                print("n має бути більшим за 1")
                continue
            break
        except ValueError: #Перевіряєм чи це число та виводимо у випадку помилки
            print("Введено не число, спробуйте ще раз")
        except Exception as e: # Перевіряємо чи немає інших помилок та якщо є повідомляємо
            print(f"Непередбачена помилка: {e}")

    answer = 1.0
    for i in range(1, n+1): # Запускаєм цикл для проводження обчислень
        answer *= ((x-i) ** 2) / x

    print(f"Результат добутку: {answer}") # Виводимо результат

def program2 (): # Створюємо функцію, щоб в подальшому простіше запускати програму
    while True: # Запускаємо нескінченний цикл, щоб програма перевіряла значення поки не буде введено правильне
        try:
            n = int(input("Введіть N: ")) # Вводимо число n

            if n <= 0: # Перевіряєм чи n більше за 0, та повідомляємо
                print("N має бути більшим за 0")
                continue

            if n % 2 != 0: # Перевіряєм чи число взагалі є степенем 2, та повідомляєм
                print("Логічна помилка число не є степенем 2")
                continue 
            break
        except ValueError: #Перевіряєм чи це число та виводимо у випадку помилки
            print("Введено не ціле число! Спробуйте ще раз")
        except Exception as e: # Перевіряємо чи немає інших помилок та якщо є повідомляємо
            print(f"Непередбачена помилка{e}")
    k = 0
    while n > 1: # Запускаємо цикл та проводимо обчислення
        n //= 2
        k += 1

    print(f"Показник степеня дорівнює {k}") # Виводимо відповідь
while True: # Запускаємо нескінченний цикл, щоб меню з'являлось кожен раз до завершення програми
    print("-----Меню-----") # Виводимо меню
    print("1.Перша задача")
    print("2.Друга задача")
    print("3.Вихід")
    print("--------------") 
    i = input("Введіть номер: ") # Записуємо номер задачі для виконання 
    if i == "1": # Якщо 1 запускаємо 1 задачу
        program1()
    elif i == "2": # Якщо 2 запускаємо 2 задачу
        program2()
    elif i == "3": #Якщо 3 завершуємо програму
        print("Програма завершена")
        break
    else: print("Ви ввели неправильне значення, спробуйте ще раз") # Якщо співпадінь немає повідомляємо про помилку